In [220]:
import pandas as pd
import sklearn as sk
from sklearn.model_selection import train_test_split, cross_val_score
from sklearn.impute import SimpleImputer
from sklearn.linear_model import LinearRegression
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler, OneHotEncoder

In [193]:
df_test = pd.read_csv("titanic_test.csv")

In [194]:
df_train = pd.read_csv("titanic_train.csv")

In [195]:
df_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [196]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [197]:
df_test.iloc[0]

PassengerId                 892
Pclass                        3
Name           Kelly, Mr. James
Sex                        male
Age                        34.5
SibSp                         0
Parch                         0
Ticket                   330911
Fare                     7.8292
Cabin                       NaN
Embarked                      Q
Name: 0, dtype: object

In [198]:
S = df_test["Name"]

In [199]:
S.head(10)

0                                Kelly, Mr. James
1                Wilkes, Mrs. James (Ellen Needs)
2                       Myles, Mr. Thomas Francis
3                                Wirz, Mr. Albert
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
5                      Svensson, Mr. Johan Cervin
6                            Connolly, Miss. Kate
7                    Caldwell, Mr. Albert Francis
8       Abrahim, Mrs. Joseph (Sophie Halaut Easu)
9                         Davies, Mr. John Samuel
Name: Name, dtype: object

In [200]:
S1= df_train[["Survived","Name"]]

In [201]:
S1.head()

   Survived                                               Name
0         0                            Braund, Mr. Owen Harris
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1                             Heikkinen, Miss. Laina
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0                           Allen, Mr. William Henry

In [202]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [203]:
df_train_nums = df_train.drop(['Name',"Sex","Ticket","Cabin","Embarked"], axis = 1, inplace = False)

In [204]:
df_train_nums.head()
df_train_nums.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Age          714 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
dtypes: float64(2), int64(5)
memory usage: 48.9 KB

In [205]:
imputer = SimpleImputer(strategy="mean")
imputer.fit(df_train_nums)
X = imputer.transform(df_train_nums)
SS = StandardScaler()
X_1 = SS.fit_transform(X)
df_train_nums_t = pd.DataFrame(X_1, columns = df_train_nums.columns, index = df_train_nums.index)

In [206]:
df_train_nums_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    float64
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    float64
 3   Age          891 non-null    float64
 4   SibSp        891 non-null    float64
 5   Parch        891 non-null    float64
 6   Fare         891 non-null    float64
dtypes: float64(7)
memory usage: 48.9 KB

In [207]:
num_atts = list(df_train_nums_t)
print(num_atts)

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [208]:
df_train_cats = df_train.drop(num_atts, axis = 1, inplace = False)
df_train_cats.info()
df_train_cats.drop(["Cabin","Name","Ticket"], axis = 1, inplace = True)
filler = {"Embarked" : "Q"}
df_train_cats.fillna(filler, inplace = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      891 non-null    object
 1   Sex       891 non-null    object
 2   Ticket    891 non-null    object
 3   Cabin     204 non-null    object
 4   Embarked  889 non-null    object
dtypes: object(5)
memory usage: 34.9+ KB

In [209]:
df_train_cats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       891 non-null    object
 1   Embarked  891 non-null    object
dtypes: object(2)
memory usage: 14.0+ KB

In [210]:
one_hot_encoder = OneHotEncoder()
df_train_cats_hot = one_hot_encoder.fit_transform(df_train_cats)
print(df_train_cats_hot)

  (0, 1)	1.0
  (0, 4)	1.0
  (1, 0)	1.0
  (1, 2)	1.0
  (2, 0)	1.0
  (2, 4)	1.0
  (3, 0)	1.0
  (3, 4)	1.0
  (4, 1)	1.0
  (4, 4)	1.0
  (5, 1)	1.0
  (5, 3)	1.0
  (6, 1)	1.0
  (6, 4)	1.0
  (7, 1)	1.0
  (7, 4)	1.0
  (8, 0)	1.0
  (8, 4)	1.0
  (9, 0)	1.0
  (9, 2)	1.0
  (10, 0)	1.0
  (10, 4)	1.0
  (11, 0)	1.0
  (11, 4)	1.0
  (12, 1)	1.0
  :	:
  (878, 4)	1.0
  (879, 0)	1.0
  (879, 2)	1.0
  (880, 0)	1.0
  (880, 4)	1.0
  (881, 1)	1.0
  (881, 4)	1.0
  (882, 0)	1.0
  (882, 4)	1.0
  (883, 1)	1.0
  (883, 4)	1.0
  (884, 1)	1.0
  (884, 4)	1.0
  (885, 0)	1.0
  (885, 3)	1.0
  (886, 1)	1.0
  (886, 4)	1.0
  (887, 0)	1.0
  (887, 4)	1.0
  (888, 0)	1.0
  (888, 4)	1.0
  (889, 1)	1.0
  (889, 2)	1.0
  (890, 1)	1.0
  (890, 3)	1.0

In [211]:
df_train_cats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       891 non-null    object
 1   Embarked  891 non-null    object
dtypes: object(2)
memory usage: 14.0+ KB

In [212]:
df_train_cats.head()

      Sex Embarked
0    male        S
1  female        C
2  female        S
3  female        S
4    male        S

In [213]:
df_train_cats.head()
gen_converter = {"male" : 0, "female" : 1}
df_train_cats["Sex"].replace(gen_converter, inplace = True)
em_converter = {"Q" : 0, "C" : 1, "S": 2}
df_train_cats["Embarked"].replace(em_converter, inplace = True)
df_train_cats.head()

   Sex  Embarked
0    0         2
1    1         1
2    1         2
3    1         2
4    0         2

In [214]:
df_train_cats.head()

   Sex  Embarked
0    0         2
1    1         1
2    1         2
3    1         2
4    0         2

In [215]:
lin_reg = LinearRegression()
df_train_final = df_train_nums_t.join(df_train_cats)
df_train_final.info()
y_val = df_train_final.Survived
x_val = df_train_final.drop(["Survived"], axis = 1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    float64
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    float64
 3   Age          891 non-null    float64
 4   SibSp        891 non-null    float64
 5   Parch        891 non-null    float64
 6   Fare         891 non-null    float64
 7   Sex          891 non-null    int64
 8   Embarked     891 non-null    int64
dtypes: float64(7), int64(2)
memory usage: 62.8 KB

In [216]:
x_train, x_test, y_train, y_test = train_test_split(x_val, y_val, test_size = 0.2, random_state = 42)

In [217]:
lin_reg.fit(x_train, y_train)

LinearRegression()

In [225]:
y_test = lin_reg.predict(x_test)
scores = cross_val_score(lin_reg, x_train, y_train, cv = 5)
print(scores)

[0.38711892 0.40073228 0.36963047 0.26796544 0.42530198]